ViniBR01/stm32-bare-metal/apps/cli/test_harness.c
void setUp(void) {
    printf_dma_flush();
}

void tearDown(void) {
    printf_dma_flush();
}

/* ====================================================================
 * RCC clock frequency tests
 * ==================================================================== */

/*
 * These tests verify the clock tree configured by SystemInit() at
 * startup: 100 MHz SYSCLK from HSI via PLL, APB1 /2 → 50 MHz,
 * APB2 /1 → 100 MHz, APB1 timer clock = APB1 × 2 = 100 MHz.
 */

void test_rcc_sysclk_is_100mhz(void)
{
    TEST_ASSERT_EQUAL_UINT32(100000000U, rcc_get_sysclk());
}

void test_rcc_apb1_clk_is_50mhz(void)
{
    TEST_ASSERT_EQUAL_UINT32(50000000U, rcc_get_apb1_clk());
}

void test_rcc_apb2_clk_is_100mhz(void)
{
    TEST_ASSERT_EQUAL_UINT32(100000000U, rcc_get_apb2_clk());
}

void test_rcc_apb1_timer_clk_is_100mhz(void)
{
    /* APB1 prescaler = /2 → timer clock = APB1 × 2 per STM32 clock tree */
    TEST_ASSERT_EQUAL_UINT32(100000000U, rcc_get_apb1_timer_clk());
}

/* ====================================================================
 * Timer hardware tests
 * ==================================================================== */

/*
 * Measure timer_delay_us(1000) against the DWT cycle counter.
 *
 * At 100 MHz, 1000 µs = 100 000 cycles. We allow ±2000 cycles (±20 µs)
 * to accommodate DWT read overhead and minor timer startup latency.
 */
#define DELAY_TEST_US           1000U
#define DELAY_EXPECTED_CYCLES   (DELAY_TEST_US * 100U)  /* 100 000 at 100 MHz */
#define DELAY_TOLERANCE_CYCLES  2000U

void test_timer_delay_us_accuracy(void)
{
    /* Enable DWT cycle counter (same pattern as spi_perf.c) */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL  |= DWT_CTRL_CYCCNTENA_Msk;

    uint32_t start = DWT->CYCCNT;
    timer_delay_us(DELAY_TEST_US);
    uint32_t elapsed = DWT->CYCCNT - start;

    TEST_ASSERT_UINT32_WITHIN_MESSAGE(
        DELAY_TOLERANCE_CYCLES,
        DELAY_EXPECTED_CYCLES,
        elapsed,
        "timer_delay_us(1000) not within ±20 us of 1 ms");
}

/* ====================================================================
 * SysTick hardware tests
 * ==================================================================== */

/*
 * Verify systick_get_ms() advances over a 5 ms hardware delay.
 *
 * timer_delay_us(5000) burns ~500 000 cycles on the Cortex-M4 timer;
 * the SysTick ISR still fires every 1 ms, so the counter must increase
 * by at least 4 ms and at most 6 ms.
 */
void test_systick_get_ms_increments(void)
{
    uint32_t before = systick_get_ms();
    timer_delay_us(5000);
    uint32_t after  = systick_get_ms();
    uint32_t diff   = after - before;   /* unsigned: handles wrap correctly */

    TEST_ASSERT_UINT32_WITHIN_MESSAGE(
        1U,       /* tolerance: ±1 ms */
        5U,       /* expected centre */
        diff,
        "systick_get_ms() did not advance ~5 ms over a 5 ms delay");
}

/*
 * Verify systick_elapsed_since() returns the correct elapsed time.
 *
 * Record start, wait 10 ms via timer_delay_us(10000), then check the
 * returned elapsed value is within 9–11 ms.
 */
void test_systick_elapsed_since(void)
{
    uint32_t start = systick_get_ms();
    timer_delay_us(10000);
    uint32_t elapsed = systick_elapsed_since(start);

    TEST_ASSERT_UINT32_WITHIN_MESSAGE(
        1U,       /* tolerance: ±1 ms */
        10U,      /* expected centre */
        elapsed,
        "systick_elapsed_since() did not return ~10 ms after a 10 ms delay");
}

/*
 * Measure systick_delay_ms(10) against the DWT cycle counter.
 *
 * At 100 MHz, 10 ms = 1 000 000 cycles.  We allow ±100 000 cycles (±1 ms)
 * because systick_delay_ms() has inherent 1 ms quantisation: depending on
 * where in the current tick period systick_get_ms() is sampled, the actual
 * wait can be anywhere from 9 ms to 10 ms.  The tolerance is set to 1 full
 * SysTick period (100 000 cycles) to cover the worst-case phase offset while
 * still confirming the delay is in the right ballpark.
 */
#define SYSTICK_DELAY_TEST_MS          10U
#define SYSTICK_DELAY_EXPECTED_CYCLES  (SYSTICK_DELAY_TEST_MS * 100000U)  /* 1 000 000 */
#define SYSTICK_DELAY_TOLERANCE_CYCLES 100000U  /* ±1 ms quantisation */

void test_systick_delay_ms_accuracy(void)
{
    /* Enable DWT cycle counter */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL  |= DWT_CTRL_CYCCNTENA_Msk;

    uint32_t start = DWT->CYCCNT;
    systick_delay_ms(SYSTICK_DELAY_TEST_MS);
    uint32_t elapsed = DWT->CYCCNT - start;

    TEST_ASSERT_UINT32_WITHIN_MESSAGE(
        SYSTICK_DELAY_TOLERANCE_CYCLES,
        SYSTICK_DELAY_EXPECTED_CYCLES,
        elapsed,
        "systick_delay_ms(10) not within ±1 ms of 10 ms");
}

/* ====================================================================
 * Non-SPI hardware tests
 * ==================================================================== */

void test_fpu_multiplication(void) {
    volatile float a = 3.14f;
    volatile float b = 2.72f;
    volatile float result = a * b;
    TEST_ASSERT_FLOAT_WITHIN_MESSAGE(0.01f, 8.54f, result,
                                     "FPU multiplication incorrect");
}

void test_fpu_division(void) {
    volatile float a = 10.0f;
    volatile float b = 4.0f;
    volatile float result = a / b;
    TEST_ASSERT_FLOAT_WITHIN_MESSAGE(0.001f, 2.5f, result,
                                     "FPU division incorrect");
}

/* ====================================================================
 * USART1 loopback tests (PA9=TX/AF7, PB7=RX/AF7)
 * ==================================================================== */

void test_usart1_loopback_0xa5(void)
{
    uart_lb_init_usart1();
    uart_lb_check(USART1, 0xA5);
}

void test_usart1_loopback_0x00(void)
{
    uart_lb_init_usart1();
    uart_lb_check(USART1, 0x00);
}

void test_usart1_loopback_0xff(void)
{
    uart_lb_init_usart1();
    uart_lb_check(USART1, 0xFF);
}

void test_usart1_loopback_sequence(void)
{
    uart_lb_init_usart1();
    /* Walking-bit and alternating patterns */
    static const uint8_t seq[] = { 0xAA, 0x55, 0x01, 0x02, 0x04, 0x08,
                                   0x10, 0x20, 0x40, 0x80, 0x12, 0x34 };
    for (uint32_t i = 0; i < sizeof(seq); i++) {
        uart_lb_check(USART1, seq[i]);
    }
}

/* ====================================================================
 * USART6 loopback tests (PC6=TX/AF8, PC7=RX/AF8)
 * ==================================================================== */

void test_usart6_loopback_0xa5(void)
{
    uart_lb_init_usart6();
    uart_lb_check(USART6, 0xA5);
}

