ViniBR01/stm32-bare-metal/apps/cli/test_harness.c
void test_usart6_loopback_0x00(void)
{
    uart_lb_init_usart6();
    uart_lb_check(USART6, 0x00);
}

void test_usart6_loopback_0xff(void)
{
    uart_lb_init_usart6();
    uart_lb_check(USART6, 0xFF);
}

void test_usart6_loopback_sequence(void)
{
    uart_lb_init_usart6();
    static const uint8_t seq[] = { 0xAA, 0x55, 0x01, 0x02, 0x04, 0x08,
                                   0x10, 0x20, 0x40, 0x80, 0x12, 0x34 };
    for (uint32_t i = 0; i < sizeof(seq); i++) {
        uart_lb_check(USART6, seq[i]);
    }
}

/* ====================================================================
 * GPIO output/input loopback test helpers
 *
 * Loopback wiring (same jumper cables used for UART loopback tests):
 *   PA9 (output) <-> PB7 (input)   — UART1 cable
 *   PC6 (output) <-> PC7 (input)   — UART6 cable
 *
 * Each test reconfigures the pins as plain push-pull GPIO output and
 * floating input, drives the output, and reads back the input.  Pins
 * are cleaned up (re-set to analog/hi-Z) after each test so they do
 * not interfere with the UART loopback tests that follow.
 * ==================================================================== */

/* Short busy-wait: ~10 µs at 100 MHz — allows the signal to propagate
 * through the loopback cable before we sample the input pin.           */
#define GPIO_LB_SETTLE_CYCLES  1000U

static void gpio_lb_settle(void)
{
    volatile uint32_t n = GPIO_LB_SETTLE_CYCLES;
    while (n--) { /* spin */ }
}

/**
 * @brief Configure the PA9/PB7 loopback pair as plain GPIO output/input.
 *
 * PA9 — push-pull output, no pull
 * PB7 — floating input, no pull
 */
static void gpio_lb_init_pa9_pb7(void)
{
    gpio_clock_enable(GPIO_PORT_A);
    gpio_clock_enable(GPIO_PORT_B);

    gpio_configure_full(GPIO_PORT_A, 9,
                        GPIO_MODE_OUTPUT, GPIO_OUTPUT_PUSH_PULL,
                        GPIO_SPEED_FAST, GPIO_PULL_NONE);

    gpio_configure_full(GPIO_PORT_B, 7,
                        GPIO_MODE_INPUT, GPIO_OUTPUT_PUSH_PULL,
                        GPIO_SPEED_LOW, GPIO_PULL_NONE);
}

/**
 * @brief Release the PA9/PB7 pair back to analog (hi-Z).
 * Called after each GPIO test so UART tests on the same pins work.
 */
static void gpio_lb_deinit_pa9_pb7(void)
{
    gpio_configure_pin(GPIO_PORT_A, 9, GPIO_MODE_ANALOG);
    gpio_configure_pin(GPIO_PORT_B, 7, GPIO_MODE_ANALOG);
}

/**
 * @brief Configure the PC6/PC7 loopback pair as plain GPIO output/input.
 *
 * PC6 — push-pull output, no pull
 * PC7 — floating input, no pull
 */
static void gpio_lb_init_pc6_pc7(void)
{
    gpio_clock_enable(GPIO_PORT_C);

    gpio_configure_full(GPIO_PORT_C, 6,
                        GPIO_MODE_OUTPUT, GPIO_OUTPUT_PUSH_PULL,
                        GPIO_SPEED_FAST, GPIO_PULL_NONE);

    gpio_configure_full(GPIO_PORT_C, 7,
                        GPIO_MODE_INPUT, GPIO_OUTPUT_PUSH_PULL,
                        GPIO_SPEED_LOW, GPIO_PULL_NONE);
}

/**
 * @brief Release the PC6/PC7 pair back to analog (hi-Z).
 */
static void gpio_lb_deinit_pc6_pc7(void)
{
    gpio_configure_pin(GPIO_PORT_C, 6, GPIO_MODE_ANALOG);
    gpio_configure_pin(GPIO_PORT_C, 7, GPIO_MODE_ANALOG);
}

/* ====================================================================
 * GPIO loopback tests
 *
 * Each function covers one loopback pair end-to-end: HIGH, LOW, and
 * toggle — all in a single init/settle/deinit cycle to minimise
 * register-write overhead and serial output volume.
 * ==================================================================== */

void test_gpio_loopback_pa9_pb7(void)
{
    gpio_lb_init_pa9_pb7();

    /* HIGH */
    gpio_set_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(1, gpio_read_pin(GPIO_PORT_B, 7),
        "PA9=HIGH should read PB7=HIGH — check jumper PA9<->PB7");

    /* LOW */
    gpio_clear_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(0, gpio_read_pin(GPIO_PORT_B, 7),
        "PA9=LOW should read PB7=LOW — check jumper PA9<->PB7");

    /* Toggle HIGH → LOW */
    gpio_toggle_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(1, gpio_read_pin(GPIO_PORT_B, 7),
        "PA9 after toggle: PB7 should be HIGH");

    gpio_toggle_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(0, gpio_read_pin(GPIO_PORT_B, 7),
        "PA9 after second toggle: PB7 should be LOW");

    gpio_lb_deinit_pa9_pb7();
}

void test_gpio_loopback_pc6_pc7(void)
{
    gpio_lb_init_pc6_pc7();

    /* HIGH */
    gpio_set_pin(GPIO_PORT_C, 6);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(1, gpio_read_pin(GPIO_PORT_C, 7),
        "PC6=HIGH should read PC7=HIGH — check jumper PC6<->PC7");

    /* LOW */
    gpio_clear_pin(GPIO_PORT_C, 6);
    gpio_lb_settle();
    TEST_ASSERT_EQUAL_MESSAGE(0, gpio_read_pin(GPIO_PORT_C, 7),
        "PC6=LOW should read PC7=LOW — check jumper PC6<->PC7");

    gpio_lb_deinit_pc6_pc7();
}

/* ====================================================================
 * EXTI interrupt tests — PA9 output triggers EXTI line 7 (port B, PB7)
 *
 * Strategy: use EXTI_MODE_INTERRUPT so that EXTI->PR is set on each
 * detected edge (the pending register is only updated in interrupt mode).
 * A minimal EXTI9_5_IRQHandler defined here overrides the Default_Handler
 * (infinite loop) weak alias: it increments a volatile counter and clears
 * the pending bit, then returns — allowing the test to observe how many
 * times the handler fired.
 *
 * Timeout guard: spin up to ~1 ms (100 000 cycles at 100 MHz) before
 * declaring a failure — long enough for any reasonable signal path but
 * short enough to avoid a multi-second hang on a disconnected jumper.
 * ==================================================================== */

/* Shared ISR counter — incremented by EXTI9_5_IRQHandler on each fire */
static volatile uint32_t g_exti9_5_count = 0;

/**
 * @brief Minimal EXTI9_5 handler: count the interrupt and clear pending.
 *
 * Overrides the Default_Handler weak alias in startup code.
 * Clears only line 7 (PB7) pending bit; other lines in the [5-9] group
 * are left untouched (none are armed in these tests).
 */
void EXTI9_5_IRQHandler(void)
{
    if (EXTI->PR & (1U << 7)) {
        EXTI->PR = (1U << 7);   /* write 1 to clear */
        g_exti9_5_count++;
    }
}

