ViniBR01/stm32-bare-metal/apps/cli/test_harness.c
#define EXTI_LB_TIMEOUT_CYCLES  100000U

/**
 * @brief Spin until g_exti9_5_count exceeds prev_count, or timeout.
 * @return 1 if count increased, 0 on timeout.
 */
static int exti_lb_wait_count(uint32_t prev_count)
{
    uint32_t n = EXTI_LB_TIMEOUT_CYCLES;
    while (n--) {
        if (g_exti9_5_count != prev_count) return 1;
    }
    return 0;
}

void test_exti_both_edges_pb7(void)
{
    gpio_lb_init_pa9_pb7();
    gpio_clear_pin(GPIO_PORT_A, 9);
    gpio_lb_settle();

    int ret = exti_configure_gpio_interrupt(GPIO_PORT_B, 7,
                                            EXTI_TRIGGER_BOTH,
                                            EXTI_MODE_INTERRUPT);
    TEST_ASSERT_EQUAL_MESSAGE(0, ret,
        "exti_configure_gpio_interrupt(PB7, BOTH) failed");

    exti_clear_pending(7);
    uint32_t prev = g_exti9_5_count;

    /* Rising edge */
    gpio_set_pin(GPIO_PORT_A, 9);
    int fired_rising = exti_lb_wait_count(prev);
    prev = g_exti9_5_count;

    /* Falling edge */
    gpio_clear_pin(GPIO_PORT_A, 9);
    int fired_falling = exti_lb_wait_count(prev);

    exti_clear_pending(7);
    exti_disable_line(7);
    exti_set_interrupt_mask(7, 0);
    gpio_lb_deinit_pa9_pb7();

    TEST_ASSERT_MESSAGE(fired_rising,
        "EXTI BOTH: rising edge did not fire — check jumper PA9<->PB7");
    TEST_ASSERT_MESSAGE(fired_falling,
        "EXTI BOTH: falling edge did not fire — check jumper PA9<->PB7");
}

void test_exti_software_trigger_pb7(void)
{
    /* Software trigger: no loopback cable required.
     * Writes to EXTI->SWIER to generate a synthetic rising edge.
     * The EXTI9_5_IRQHandler defined above will fire and increment
     * g_exti9_5_count, confirming end-to-end EXTI machinery works.  */
    gpio_clock_enable(GPIO_PORT_B);
    gpio_configure_pin(GPIO_PORT_B, 7, GPIO_MODE_INPUT);

    /* Enable SYSCFG clock (needed by exti_configure_gpio_interrupt) */
    RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;

    /* Configure for rising edge, interrupt mode */
    int ret = exti_configure_gpio_interrupt(GPIO_PORT_B, 7,
                                            EXTI_TRIGGER_RISING,
                                            EXTI_MODE_INTERRUPT);
    TEST_ASSERT_EQUAL_MESSAGE(0, ret,
        "exti_configure_gpio_interrupt for software trigger test failed");

    exti_clear_pending(7);
    uint32_t prev = g_exti9_5_count;

    /* Fire software trigger */
    int sw_ret = exti_software_trigger(7);
    TEST_ASSERT_EQUAL_MESSAGE(0, sw_ret,
        "exti_software_trigger(7) returned error");

    /* Wait for ISR to fire */
    int fired = exti_lb_wait_count(prev);

    /* Cleanup */
    exti_clear_pending(7);
    exti_disable_line(7);
    exti_set_interrupt_mask(7, 0);
    gpio_configure_pin(GPIO_PORT_B, 7, GPIO_MODE_ANALOG);

    TEST_ASSERT_MESSAGE(fired,
        "EXTI software trigger: ISR did not fire");
}

/* ====================================================================
 * Flash hardware tests — Tier 6
 *
 * Uses sector 7 (0x08060000, 128 KB) as the scratch area.  Sector 7
 * is reserved for slot B in Phase 1.7 of the bootloader plan but
 * unused in Phase 1.5, which makes it the only sector that is both
 * (a) inside the on-chip flash and (b) not currently mapped to
 * anything the running firmware needs.
 *
 * History note (2026-05-30): this used to point at sector 4
 * (`FLASH_TEST_SECTOR=4`, `FLASH_TEST_BASE_ADDR=0x08010000`), which
 * happens to be the start of slot A under the Phase 1.5 bootloader
 * skeleton.  Running `run_all_tests` on a slot-A image would erase
 * the running image; the chip stayed alive long enough to print PASS
 * (I-cache + prefetch) but the next reset dropped into
 * `bootloader_halt()` with `mdw 0x08010000 4 == FFFFFFFF`.  The fix
 * also moved the affected tests to a sector the firmware does not
 * occupy and added an active-image guard
 * (`test_flash_scratch_sector_is_safe`) that fails loudly if a future
 * layout change moves the running image into the scratch sector.
 * See docs/wiki/plans/001-bootloader/spi1-dma-fault-investigation.md
 * for the full chain.
 *
 * Slot B (Phase 1.7) will reclaim sector 7.  When that happens, this
 * test must move with it: re-run host tests + a HIL pass and update
 * the constants below alongside the slot-B linker change.
 *
 * Wear-levelling strategy: a SINGLE erase per test run. The first test
 * erases + verifies, subsequent tests write to different offsets within
 * the already-erased sector. This gives ~10K CI runs before the sector
 * wears out (STM32F411 flash endurance spec).
 * ==================================================================== */

#define FLASH_TEST_SECTOR     7U
#define FLASH_TEST_BASE_ADDR  0x08060000U

/* Provided by linker/app_ls.ld for slot-relocated app builds; the
 * bootloader build leaves it undefined and we never reach the flash
 * tests from there, so the weak attribute keeps the link clean. */
extern uint32_t _app_vector_base __attribute__((weak));

void test_flash_scratch_sector_is_safe(void)
{
    /* Compile-time sanity: the constants in this file agree. */
    TEST_ASSERT_EQUAL_HEX32_MESSAGE(
        flash_get_sector_address(FLASH_TEST_SECTOR),
        FLASH_TEST_BASE_ADDR,
        "FLASH_TEST_BASE_ADDR does not match flash_get_sector_address(FLASH_TEST_SECTOR)");

    /* Runtime guard: the scratch sector must not contain the running
     * image's vector table.  Without this, a future linker / slot-base
     * change could re-introduce the slot-A self-erase failure mode
     * silently (the test would still pass while quietly bricking slot A
     * on the next reset). */
    uintptr_t vbase = (uintptr_t)&_app_vector_base;
    TEST_ASSERT_NOT_EQUAL_MESSAGE(0u, vbase,
        "_app_vector_base is 0 -- this test is only valid for slot-A app builds");

    uint8_t app_sector = 0xFFu;
    err_t rc = flash_sector_for_address((uint32_t)vbase, &app_sector);
    TEST_ASSERT_EQUAL_MESSAGE(ERR_OK, rc,
        "_app_vector_base is outside on-chip flash");
    TEST_ASSERT_NOT_EQUAL_MESSAGE(FLASH_TEST_SECTOR, app_sector,
        "FLASH_TEST_SECTOR equals the running app's sector -- erasing it would brick the slot");
}

