ViniBR01/stm32-bare-metal/apps/cli/test_harness.c
    /* Set EXTI pending via software trigger so WFI wakes immediately */
    exti_software_trigger(7);

    /* Enter Stop mode — wakes immediately due to pending EXTI */
    enter_stop_mode();

    /* Restore PLL to 100 MHz (Stop mode reverts to HSI) */
    rcc_init(RCC_CLK_SRC_HSI, 100000000U);
    systick_init();

    /* Verify clock restored */
    TEST_ASSERT_EQUAL_UINT32_MESSAGE(100000000U, rcc_get_sysclk(),
        "SYSCLK not restored to 100 MHz after Stop mode wake");

    /* Cleanup EXTI */
    exti_clear_pending(7);
    exti_disable_line(7);
    exti_set_interrupt_mask(7, 0);
    gpio_configure_pin(GPIO_PORT_B, 7, GPIO_MODE_ANALOG);
}

/* ====================================================================
 * Software BPSK modem — Tier 9 (Plan 002 B0.3)
 *
 * Runs the self-contained PRBS -> BPSK -> AWGN -> slice -> BER chain on the
 * Cortex-M4F and reports two metrics: the measured bit-error rate (in parts
 * per million) and the DWT cycle count for the run (from which cycles/bit is
 * derived).  No external wiring — the channel is software AWGN.
 *
 * Correctness gate (computed on-device): the measured BER must land within a
 * factor of two of the closed-form BPSK theory, AND cycles/bit must be under a
 * generous budget.  The factor-of-two band is deliberately loose: with a fixed
 * seed the run is deterministic, but the band stays robust to toolchain/libm
 * drift while still catching a broken chain (BER ~0 or ~0.5).  The tight
 * performance gate is the baseline JSON (cycles +/- tolerance).
 * ==================================================================== */

#define MODEM_BER_SEED            1u
#define MODEM_BER_SNR_DB          6.0f
/*
 * 100000 bits at theory BER ~2.4e-3 gives ~239 expected errors, enough
 * statistical margin for the factor-of-two band below; shrinking this would
 * make the band flaky.  cyc/bit is dominated by the AWGN Box-Muller (libm
 * sqrtf/logf/sinf/cosf), not the BPSK map/slice — hence the loose budget.
 */
#define MODEM_BER_NBITS           100000u
/*
 * Measured ~1039 cyc/bit on the F411 @ 100 MHz (Box-Muller sqrtf/logf/sinf/
 * cosf per noise sample dominates).  1500 leaves ~45% headroom as a coarse
 * "did something blow up" guard; the tight performance gate is the baseline
 * JSON cycles +/- tolerance, not this number.
 */
#define MODEM_CYC_PER_BIT_BUDGET  1500u

/*
 * Block buffers for the staged chain (see modem_run_chain in
 * apps/dsp/modem_sim.c — the test mirrors it so the CI breakdown matches the
 * interactive app).  4 KB of .bss (1+2+1), only present in HIL builds.
 */
#define MODEM_BER_BLOCK 1024u
static uint8_t modem_tx_block[MODEM_BER_BLOCK];
static q15_t   modem_sym_block[MODEM_BER_BLOCK];
static uint8_t modem_rx_block[MODEM_BER_BLOCK];

void test_modem_bpsk_ber_awgn(void)
{
    prbs_t      tx;
    awgn_prng_t rng;

    prbs_init(&tx, PRBS9, MODEM_BER_SEED);
    awgn_prng_seed(&rng, MODEM_BER_SEED);

    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    /*
     * Five separately-timed stages, accumulated across blocks.  Errors are
     * counted by comparing the sliced rx bits against the generated tx bits,
     * so the check stage measures a real comparison rather than a second PRBS
     * regeneration.  Mirrors apps/dsp/modem_sim.c modem_run_chain().
     */
    uint32_t gen_cyc = 0, mod_cyc = 0, chan_cyc = 0, demod_cyc = 0, check_cyc = 0;
    uint64_t errors = 0;

    uint32_t remaining = MODEM_BER_NBITS;
    while (remaining > 0u) {
        uint32_t n = (remaining < MODEM_BER_BLOCK) ? remaining : MODEM_BER_BLOCK;

        uint32_t t0 = DWT->CYCCNT;
        prbs_next_bits(&tx, modem_tx_block, n);
        uint32_t t1 = DWT->CYCCNT;
        bpsk_map_block(modem_tx_block, modem_sym_block, n);
        uint32_t t2 = DWT->CYCCNT;
        channel_awgn_apply(modem_sym_block, n, MODEM_BER_SNR_DB, &rng);
        uint32_t t3 = DWT->CYCCNT;
        bpsk_slice_block(modem_sym_block, modem_rx_block, n);
        uint32_t t4 = DWT->CYCCNT;
        for (uint32_t i = 0; i < n; i++) {
            if (modem_rx_block[i] != modem_tx_block[i]) {
                errors++;
            }
        }
        uint32_t t5 = DWT->CYCCNT;

        gen_cyc   += t1 - t0;
        mod_cyc   += t2 - t1;
        chan_cyc  += t3 - t2;
        demod_cyc += t4 - t3;
        check_cyc += t5 - t4;
        remaining -= n;
    }

    uint32_t cycles      = gen_cyc + mod_cyc + chan_cyc + demod_cyc + check_cyc;
    uint64_t total       = MODEM_BER_NBITS;
    uint32_t ber_ppm     = (uint32_t)((errors * 1000000ull) / total);
    double   theory      = channel_awgn_theory_ber(MODEM_BER_SNR_DB);
    uint32_t theory_ppm  = (uint32_t)(theory * 1.0e6 + 0.5);
    uint32_t cyc_per_bit = (uint32_t)(cycles / total);

    /* Factor-of-two correctness band around theory. */
    int ber_ok = (theory_ppm > 0u) &&
                 (ber_ppm >= theory_ppm / 2u) && (ber_ppm <= theory_ppm * 2u);
    int cyc_ok = (cyc_per_bit <= MODEM_CYC_PER_BIT_BUDGET);
    int pass   = ber_ok && cyc_ok;

    /*
     * Emit the machine-parseable lines BEFORE the asserts: Unity longjmps out
     * of the test on the first failure, so the metrics must already be printed
     * for the runner to record them even on a fail.  The main line is gated
     * (ber_ppm + total cycles); the five per-stage lines are report-only
     * (null baselines) so the breakdown shows up in CI / JUnit without gating.
     * Per-stage value is cyc/1000-bits for sub-cyc/bit resolution.
     *
     * Flush after every line: six TEST: lines back-to-back overrun the
     * printf_dma buffer, which truncated/merged the demod+check lines in the
     * serial capture otherwise.
     */
    TEST_OUTPUT_RESULT("modem_bpsk_ber_snr6", pass, cycles, "ber_ppm", ber_ppm);
    printf_dma_flush();
    TEST_OUTPUT_RESULT("modem_cyc_gen",   1, gen_cyc,   "cyc_per_kbit",
                       (uint32_t)((uint64_t)gen_cyc   * 1000u / total));
    printf_dma_flush();
    TEST_OUTPUT_RESULT("modem_cyc_mod",   1, mod_cyc,   "cyc_per_kbit",
                       (uint32_t)((uint64_t)mod_cyc   * 1000u / total));
    printf_dma_flush();
    TEST_OUTPUT_RESULT("modem_cyc_chan",  1, chan_cyc,  "cyc_per_kbit",
                       (uint32_t)((uint64_t)chan_cyc  * 1000u / total));
    printf_dma_flush();
    TEST_OUTPUT_RESULT("modem_cyc_demod", 1, demod_cyc, "cyc_per_kbit",
                       (uint32_t)((uint64_t)demod_cyc * 1000u / total));
    printf_dma_flush();
    TEST_OUTPUT_RESULT("modem_cyc_check", 1, check_cyc, "cyc_per_kbit",
                       (uint32_t)((uint64_t)check_cyc * 1000u / total));
    printf_dma_flush();

    printf("  [modem] BER=%.3e theory=%.3e cyc/bit=%lu\n",
           (double)ber_ppm / 1.0e6, theory, (unsigned long)cyc_per_bit);
    /* Per-stage cost in cyc per 1000 bits: the non-channel stages are well
     * under 1 cyc/bit, so kbit resolution keeps them from rounding to 0. */
    printf("  [modem] cyc/kbit gen=%lu mod=%lu chan=%lu demod=%lu check=%lu\n",
           (unsigned long)((uint64_t)gen_cyc   * 1000u / total),
           (unsigned long)((uint64_t)mod_cyc   * 1000u / total),
           (unsigned long)((uint64_t)chan_cyc  * 1000u / total),
           (unsigned long)((uint64_t)demod_cyc * 1000u / total),
           (unsigned long)((uint64_t)check_cyc * 1000u / total));
    printf_dma_flush();

    TEST_ASSERT_TRUE_MESSAGE(ber_ok, "BPSK BER outside factor-2 band of theory");
    TEST_ASSERT_TRUE_MESSAGE(cyc_ok, "BPSK modem cyc/bit over budget");
}

/* ====================================================================
 * Main test runner
 * ==================================================================== */

int run_unity_tests(void) {
    UNITY_BEGIN();

    /* ----------------------------------------------------------
     * Tier 1: Smoke test — all 5 SPIs at max speed
     *   prescaler=2, 256 bytes, polled + DMA
     * ---------------------------------------------------------- */
    printf("\n--- Tier 1: All-SPI smoke (psc=2, 256B) ---\n");
    printf_dma_flush();

    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 256, 0);   /* SPI1 polled */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 256, 1);   /* SPI1 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 256, 0);   /* SPI2 polled */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 256, 1);   /* SPI2 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_3, 2, 256, 0);   /* SPI3 polled */
    RUN_SPI_TEST(SPI_INSTANCE_3, 2, 256, 1);   /* SPI3 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_4, 2, 256, 0);   /* SPI4 polled */
    RUN_SPI_TEST(SPI_INSTANCE_4, 2, 256, 1);   /* SPI4 DMA    */
    RUN_SPI_TEST(SPI_INSTANCE_5, 2, 256, 0);   /* SPI5 polled */
    RUN_SPI_TEST(SPI_INSTANCE_5, 2, 256, 1);   /* SPI5 DMA    */

    /* ----------------------------------------------------------
     * Tier 2a: Deep sweep — SPI2 (APB1, 50 MHz bus)
     *   Prescaler sweep: 2, 4, 8, 16, 32, 64, 128, 256
     *   Buffer sizes: 1, 4, 16, 64, 256
     *   Both polled and DMA
     *
     *   Full matrix is 8×5×2 = 80 tests. We select a representative
     *   subset: all prescalers at 256B, all sizes at prescaler=2,
     *   plus DMA mirrors. This gives thorough coverage with ~30 tests.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 2a: SPI2 (APB1 50MHz) deep sweep ---\n");
    printf_dma_flush();

    /* Prescaler sweep at 256 bytes — polled */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 4,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 8,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 16,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 32,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 64,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 128, 256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 256, 256, 0);

    /* Prescaler sweep at 256 bytes — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 4,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 8,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 16,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 32,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 64,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 128, 256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 256, 256, 1);

    /* Buffer size sweep at prescaler=2 — polled */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 1,   0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 4,   0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 16,  0);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 64,  0);

    /* Buffer size sweep at prescaler=2 — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 1,   1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 4,   1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 16,  1);
    RUN_SPI_TEST(SPI_INSTANCE_2, 2, 64,  1);

    /* ----------------------------------------------------------
     * Tier 2b: Deep sweep — SPI1 (APB2, 100 MHz bus)
     *   Same test matrix structure as SPI2.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 2b: SPI1 (APB2 100MHz) deep sweep ---\n");
    printf_dma_flush();

    /* Prescaler sweep at 256 bytes — polled */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 4,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 8,   256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 16,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 32,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 64,  256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 128, 256, 0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 256, 256, 0);

    /* Prescaler sweep at 256 bytes — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 4,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 8,   256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 16,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 32,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 64,  256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 128, 256, 1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 256, 256, 1);

    /* Buffer size sweep at prescaler=2 — polled */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 1,   0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 4,   0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 16,  0);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 64,  0);

    /* Buffer size sweep at prescaler=2 — DMA */
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 1,   1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 4,   1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 16,  1);
    RUN_SPI_TEST(SPI_INSTANCE_1, 2, 64,  1);

    /* ----------------------------------------------------------
     * Tier 3: Non-SPI hardware tests
     * ---------------------------------------------------------- */
    printf("\n--- Tier 3: FPU tests ---\n");
    printf_dma_flush();

    RUN_TEST(test_fpu_multiplication);
    RUN_TEST(test_fpu_division);

    /* ----------------------------------------------------------
     * Tier 4: RCC and Timer hardware tests
     * ---------------------------------------------------------- */
    printf("\n--- Tier 4: RCC clock tree ---\n");
    printf_dma_flush();

    RUN_TEST(test_rcc_sysclk_is_100mhz);
    RUN_TEST(test_rcc_apb1_clk_is_50mhz);
    RUN_TEST(test_rcc_apb2_clk_is_100mhz);
    RUN_TEST(test_rcc_apb1_timer_clk_is_100mhz);

    printf("\n--- Tier 4: Timer delay accuracy ---\n");
    printf_dma_flush();

    RUN_TEST(test_timer_delay_us_accuracy);

    /* ----------------------------------------------------------
     * Tier 4: SysTick tests
     *   systick_init() is called by main() at startup, so the counter
     *   is already running when these tests execute.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 4: SysTick tests ---\n");
    printf_dma_flush();

    RUN_TEST(test_systick_get_ms_increments);
    RUN_TEST(test_systick_elapsed_since);
    RUN_TEST(test_systick_delay_ms_accuracy);

    /* ----------------------------------------------------------
     * Tier 5: UART loopback hardware tests
     *   USART1: PA9 (TX/AF7) wired to PB7 (RX/AF7)
     *   USART6: PC6 (TX/AF8) wired to PC7 (RX/AF8)
     *   115200 baud, polled, no DMA/interrupts.
     * ---------------------------------------------------------- */
    printf("\n--- Tier 5: USART1 loopback (PA9/PB7) ---\n");
    printf_dma_flush();

